Catalogs/ТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ТранспортныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Легковые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузовые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецтехника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТранспортныеСредства/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
    // Пропускаем группы
    Если ЭтоГруппа Тогда
        Возврат;
    КонецЕсли;

    // Проверка заполнения обязательных полей
    Если НЕ ЗначениеЗаполнено(НомерТС) Тогда
        Сообщить("Поле 'Номер ТС' обязательно для заполнения!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Удаляем "RUS" из номера, если присутствует
    НомерТСБезRUS = СтрЗаменить(НомерТС, "RUS", "");
    НомерТСБезRUS = СокрЛП(НомерТСБезRUS);

    // Нормализация НомерТС (удаляем пробелы перед проверкой и сохранением)
    НомерТСБезПробелов = СтрЗаменить(НомерТСБезRUS, " ", "");

    // Проверка заполнения ТипТС
    Если НЕ ЗначениеЗаполнено(ТипТС) Тогда
        Сообщить("Не указан ТипТС!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Сохраняем НомерТС без пробелов и без RUS
    НомерТС = НомерТСБезПробелов;

    // Проверка заполнения Марка
    Если НЕ ЗначениеЗаполнено(Марка) Тогда
        Сообщить("Поле 'Марка' обязательно для заполнения!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Проверка заполнения Модель
    Если НЕ ЗначениеЗаполнено(Модель) Тогда
        Сообщить("Поле 'Модель' обязательно для заполнения!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Формирование наименования элемента
    Наименование = СокрЛП(Марка) + " " + СокрЛП(Модель) + " " + НомерТС;
    // Например: "Toyota Camry С065МК78"

    // Установка родителя на основе ТипТС
    ГруппаЛегковые = Справочники.ТранспортныеСредства.НайтиПоНаименованию("Легковые", Истина);
    ГруппаГрузовые = Справочники.ТранспортныеСредства.НайтиПоНаименованию("Грузовые", Истина);
    ГруппаСпецтехника = Справочники.ТранспортныеСредства.НайтиПоНаименованию("Спецтехника", Истина);

    Если ТипТС = Перечисления.ТипыТС.Легковые Тогда
        Если НЕ ГруппаЛегковые.Пустая() Тогда
            Родитель = ГруппаЛегковые;
        Иначе
            Сообщить("Группа 'Легковые' не найдена. Элемент будет записан без группы.");
        КонецЕсли;
    ИначеЕсли ТипТС = Перечисления.ТипыТС.Грузовые Тогда
        Если НЕ ГруппаГрузовые.Пустая() Тогда
            Родитель = ГруппаГрузовые;
        Иначе
            Сообщить("Группа 'Грузовые' не найдена. Элемент будет записан без группы.");
        КонецЕсли;
    ИначеЕсли ТипТС = Перечисления.ТипыТС.Спецтехника Тогда
        Если НЕ ГруппаСпецтехника.Пустая() Тогда
            Родитель = ГруппаСпецтехника;
        Иначе
            Сообщить("Группа 'Спецтехника' не найдена. Элемент будет записан без группы.");
        КонецЕсли;
    Иначе
        Сообщить("Не указан ТипТС. Элемент будет записан без группы.");
    КонецЕсли;
КонецПроцедуры
